app/controllers/guestlists_controller.rb

SELECT "guestlists"."created_at" FROM "guestlists"
SELECT "users".* FROM "users" WHERE (id IN (SELECT "guestlists"."user_id" FROM "guestlists"  ORDER BY "guestlists"."created_at" ASC))
---
  def index
    #@guestlist = User.where("id IN (?)", Guestlist.select(:user_id).order(:created_at))
    order = Guestlist.pluck(:user_id)
    @guestlist = User.find(order).index_by(&:id).slice(*order).values

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @guestlist = User.find(params[:id])