app/controllers/users_controller.rb

  def create_to_queue
    @user = User.all
    #Redirect To couselor page if user is counselor(jjbetz = John Josh Brian Eric Tae Zach)
    if existing_user_params.downcase == "jjbetz@cemail.com"
 	  redirect_to action: 'index', controller: 'guestlists'
      #for adding existing user to guestlist
    elsif @user.valid_email?(existing_user_params)
        Guestlist.create(user_id: User.find_by(email: existing_user_params).id)
---
SELECT  "users".* FROM "users" WHERE (a@b.c) LIMIT 1
INSERT INTO "guestlists" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 10], ["created_at", "2015-11-07 05:00:40.695047"], ["updated_at", "2015-11-07 05:00:40.695047"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "test@test.test"]]

  def create
    #for adding new users to database
    @user = User.create(new_user_params)
    @guest = Guestlist.create(user_id: User.last.id)
---
INSERT INTO "users" ("fname", "lname", "email") VALUES (?, ?, ?)  [["fname", "John"], ["lname", "Sieben"], ["email", "hello@world.com"]]
INSERT INTO "guestlists" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 6], ["created_at", "2015-11-07 00:59:58.162210"], ["updated_at", "2015-11-07 00:59:58.162210"]]
INSERT INTO "guests" ("fname", "lname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["fname", "John"], ["lname", "Sieben"], ["email", "hello@world.com"], ["created_at", "2015-11-06 20:04:41.287453"], ["updated_at", "2015-11-06 20:04:41.287453"]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1

  def update
    #update from hitting 'Finish' in guest list show page
    redirect_to controller: 'guestlists', action: 'index'
    Guestlist.find_by(user_id: params[:id]).destroy
    user = User.find(params[:id])
    user.notes = params[:user][:notes]
    user.save
---
DELETE FROM "guestlists" WHERE "guestlists"."id" = ?  [["id", 1]]
SELECT  "guestlists".* FROM "guestlists" WHERE "guestlists"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "notes" = ? WHERE "users"."id" = ?  [["notes", ""], ["id", 1]]